modm-ext/archive-stmicro-svd/header_stm32l4r7aii6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <baseAddress>0x4002b000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEIE</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIE</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIE</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TEIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTEIF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTWIF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAECIF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCEIF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMAR</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGOR</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGMAR</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGOR</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFCCR</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCOLR</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGPFCCR</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CCM</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCOLR</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLUE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCMAR</name>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCMAR</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OPFCCR</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SB</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBS</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OCOLR</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>OMAR</name>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OOR</name>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NLR</name>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>PL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LWR</name>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AMTCR</name>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DT</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGCLUT.0</name>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.1</name>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.2</name>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.3</name>
          <addressOffset>0x40c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.4</name>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.5</name>
          <addressOffset>0x414</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.6</name>
          <addressOffset>0x418</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.7</name>
          <addressOffset>0x41c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.8</name>
          <addressOffset>0x420</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.9</name>
          <addressOffset>0x424</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.10</name>
          <addressOffset>0x428</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.11</name>
          <addressOffset>0x42c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.12</name>
          <addressOffset>0x430</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.13</name>
          <addressOffset>0x434</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.14</name>
          <addressOffset>0x438</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.15</name>
          <addressOffset>0x43c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.16</name>
          <addressOffset>0x440</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.17</name>
          <addressOffset>0x444</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.18</name>
          <addressOffset>0x448</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.19</name>
          <addressOffset>0x44c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.20</name>
          <addressOffset>0x450</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.21</name>
          <addressOffset>0x454</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.22</name>
          <addressOffset>0x458</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.23</name>
          <addressOffset>0x45c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.24</name>
          <addressOffset>0x460</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.25</name>
          <addressOffset>0x464</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.26</name>
          <addressOffset>0x468</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.27</name>
          <addressOffset>0x46c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.28</name>
          <addressOffset>0x470</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.29</name>
          <addressOffset>0x474</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.30</name>
          <addressOffset>0x478</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.31</name>
          <addressOffset>0x47c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.32</name>
          <addressOffset>0x480</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.33</name>
          <addressOffset>0x484</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.34</name>
          <addressOffset>0x488</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.35</name>
          <addressOffset>0x48c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.36</name>
          <addressOffset>0x490</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.37</name>
          <addressOffset>0x494</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.38</name>
          <addressOffset>0x498</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.39</name>
          <addressOffset>0x49c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.40</name>
          <addressOffset>0x4a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.41</name>
          <addressOffset>0x4a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.42</name>
          <addressOffset>0x4a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.43</name>
          <addressOffset>0x4ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.44</name>
          <addressOffset>0x4b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.45</name>
          <addressOffset>0x4b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.46</name>
          <addressOffset>0x4b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.47</name>
          <addressOffset>0x4bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.48</name>
          <addressOffset>0x4c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.49</name>
          <addressOffset>0x4c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.50</name>
          <addressOffset>0x4c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.51</name>
          <addressOffset>0x4cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.52</name>
          <addressOffset>0x4d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.53</name>
          <addressOffset>0x4d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.54</name>
          <addressOffset>0x4d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.55</name>
          <addressOffset>0x4dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.56</name>
          <addressOffset>0x4e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.57</name>
          <addressOffset>0x4e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.58</name>
          <addressOffset>0x4e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.59</name>
          <addressOffset>0x4ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.60</name>
          <addressOffset>0x4f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.61</name>
          <addressOffset>0x4f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.62</name>
          <addressOffset>0x4f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.63</name>
          <addressOffset>0x4fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.64</name>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.65</name>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.66</name>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.67</name>
          <addressOffset>0x50c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.68</name>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.69</name>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.70</name>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.71</name>
          <addressOffset>0x51c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.72</name>
          <addressOffset>0x520</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.73</name>
          <addressOffset>0x524</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>FGCLUT.74</name>
          <addressOffset>0x528</addressOffset>
          <size>0x20</size>
        </register>
