modm-ext/archive-stmicro-svd/header_stm32l4r7aii6.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GFXMMU</name>
      <baseAddress>0x4002c000</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B0OIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1OIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2OIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3OIE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMEIE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>192BM</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>B0OF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B1OF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B2OF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B3OF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMEF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CB0OF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CB1OF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CB2OF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CB3OF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAMEF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DVR</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DV</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>B0CR</name>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PBO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PBBA</name>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>B1CR</name>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PBO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PBBA</name>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>B2CR</name>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PBO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PBBA</name>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>B3CR</name>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PBO</name>
              <bitOffset>4</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PBBA</name>
              <bitOffset>23</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT.0</name>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1</name>
          <addressOffset>0x1004</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2</name>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.3</name>
          <addressOffset>0x100c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.4</name>
          <addressOffset>0x1010</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.5</name>
          <addressOffset>0x1014</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.6</name>
          <addressOffset>0x1018</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.7</name>
          <addressOffset>0x101c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.8</name>
          <addressOffset>0x1020</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.9</name>
          <addressOffset>0x1024</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.10</name>
          <addressOffset>0x1028</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.11</name>
          <addressOffset>0x102c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.12</name>
          <addressOffset>0x1030</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.13</name>
          <addressOffset>0x1034</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.14</name>
          <addressOffset>0x1038</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.15</name>
          <addressOffset>0x103c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.16</name>
          <addressOffset>0x1040</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.17</name>
          <addressOffset>0x1044</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.18</name>
          <addressOffset>0x1048</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.19</name>
          <addressOffset>0x104c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.20</name>
          <addressOffset>0x1050</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.21</name>
          <addressOffset>0x1054</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.22</name>
          <addressOffset>0x1058</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.23</name>
          <addressOffset>0x105c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.24</name>
          <addressOffset>0x1060</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.25</name>
          <addressOffset>0x1064</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.26</name>
          <addressOffset>0x1068</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.27</name>
          <addressOffset>0x106c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.28</name>
          <addressOffset>0x1070</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.29</name>
          <addressOffset>0x1074</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.30</name>
          <addressOffset>0x1078</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.31</name>
          <addressOffset>0x107c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.32</name>
          <addressOffset>0x1080</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.33</name>
          <addressOffset>0x1084</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.34</name>
          <addressOffset>0x1088</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.35</name>
          <addressOffset>0x108c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.36</name>
          <addressOffset>0x1090</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.37</name>
          <addressOffset>0x1094</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.38</name>
          <addressOffset>0x1098</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.39</name>
          <addressOffset>0x109c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.40</name>
          <addressOffset>0x10a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.41</name>
          <addressOffset>0x10a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.42</name>
          <addressOffset>0x10a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.43</name>
          <addressOffset>0x10ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.44</name>
          <addressOffset>0x10b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.45</name>
          <addressOffset>0x10b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.46</name>
          <addressOffset>0x10b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.47</name>
          <addressOffset>0x10bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.48</name>
          <addressOffset>0x10c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.49</name>
          <addressOffset>0x10c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.50</name>
          <addressOffset>0x10c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.51</name>
          <addressOffset>0x10cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.52</name>
          <addressOffset>0x10d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.53</name>
          <addressOffset>0x10d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.54</name>
          <addressOffset>0x10d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.55</name>
          <addressOffset>0x10dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.56</name>
          <addressOffset>0x10e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.57</name>
          <addressOffset>0x10e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.58</name>
          <addressOffset>0x10e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.59</name>
          <addressOffset>0x10ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.60</name>
          <addressOffset>0x10f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.61</name>
          <addressOffset>0x10f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.62</name>
          <addressOffset>0x10f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.63</name>
          <addressOffset>0x10fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.64</name>
          <addressOffset>0x1100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.65</name>
          <addressOffset>0x1104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.66</name>
          <addressOffset>0x1108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.67</name>
          <addressOffset>0x110c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.68</name>
          <addressOffset>0x1110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.69</name>
          <addressOffset>0x1114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.70</name>
          <addressOffset>0x1118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.71</name>
          <addressOffset>0x111c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.72</name>
          <addressOffset>0x1120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.73</name>
          <addressOffset>0x1124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.74</name>
          <addressOffset>0x1128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.75</name>
          <addressOffset>0x112c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.76</name>
          <addressOffset>0x1130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.77</name>
          <addressOffset>0x1134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.78</name>
          <addressOffset>0x1138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.79</name>
          <addressOffset>0x113c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.80</name>
          <addressOffset>0x1140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.81</name>
          <addressOffset>0x1144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.82</name>
          <addressOffset>0x1148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.83</name>
          <addressOffset>0x114c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.84</name>
          <addressOffset>0x1150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.85</name>
          <addressOffset>0x1154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.86</name>
          <addressOffset>0x1158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.87</name>
          <addressOffset>0x115c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.88</name>
          <addressOffset>0x1160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.89</name>
          <addressOffset>0x1164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.90</name>
          <addressOffset>0x1168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.91</name>
          <addressOffset>0x116c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.92</name>
          <addressOffset>0x1170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.93</name>
          <addressOffset>0x1174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.94</name>
          <addressOffset>0x1178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.95</name>
          <addressOffset>0x117c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.96</name>
          <addressOffset>0x1180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.97</name>
          <addressOffset>0x1184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.98</name>
          <addressOffset>0x1188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.99</name>
          <addressOffset>0x118c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.100</name>
          <addressOffset>0x1190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.101</name>
          <addressOffset>0x1194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.102</name>
          <addressOffset>0x1198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.103</name>
          <addressOffset>0x119c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.104</name>
          <addressOffset>0x11a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.105</name>
          <addressOffset>0x11a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.106</name>
          <addressOffset>0x11a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.107</name>
          <addressOffset>0x11ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.108</name>
          <addressOffset>0x11b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.109</name>
          <addressOffset>0x11b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.110</name>
          <addressOffset>0x11b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.111</name>
          <addressOffset>0x11bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.112</name>
          <addressOffset>0x11c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.113</name>
          <addressOffset>0x11c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.114</name>
          <addressOffset>0x11c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.115</name>
          <addressOffset>0x11cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.116</name>
          <addressOffset>0x11d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.117</name>
          <addressOffset>0x11d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.118</name>
          <addressOffset>0x11d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.119</name>
          <addressOffset>0x11dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.120</name>
          <addressOffset>0x11e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.121</name>
          <addressOffset>0x11e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.122</name>
          <addressOffset>0x11e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.123</name>
          <addressOffset>0x11ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.124</name>
          <addressOffset>0x11f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.125</name>
          <addressOffset>0x11f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.126</name>
          <addressOffset>0x11f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.127</name>
          <addressOffset>0x11fc</addressOffset>
          <size>0x20</size>
        </register>
