modm-ext/archive-stmicro-svd/header_stm32l4r7aii6.svd
        <register>
          <name>LUT.1600</name>
          <addressOffset>0x2900</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1601</name>
          <addressOffset>0x2904</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1602</name>
          <addressOffset>0x2908</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1603</name>
          <addressOffset>0x290c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1604</name>
          <addressOffset>0x2910</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1605</name>
          <addressOffset>0x2914</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1606</name>
          <addressOffset>0x2918</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1607</name>
          <addressOffset>0x291c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1608</name>
          <addressOffset>0x2920</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1609</name>
          <addressOffset>0x2924</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1610</name>
          <addressOffset>0x2928</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1611</name>
          <addressOffset>0x292c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1612</name>
          <addressOffset>0x2930</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1613</name>
          <addressOffset>0x2934</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1614</name>
          <addressOffset>0x2938</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1615</name>
          <addressOffset>0x293c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1616</name>
          <addressOffset>0x2940</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1617</name>
          <addressOffset>0x2944</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1618</name>
          <addressOffset>0x2948</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1619</name>
          <addressOffset>0x294c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1620</name>
          <addressOffset>0x2950</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1621</name>
          <addressOffset>0x2954</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1622</name>
          <addressOffset>0x2958</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1623</name>
          <addressOffset>0x295c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1624</name>
          <addressOffset>0x2960</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1625</name>
          <addressOffset>0x2964</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1626</name>
          <addressOffset>0x2968</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1627</name>
          <addressOffset>0x296c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1628</name>
          <addressOffset>0x2970</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1629</name>
          <addressOffset>0x2974</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1630</name>
          <addressOffset>0x2978</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1631</name>
          <addressOffset>0x297c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1632</name>
          <addressOffset>0x2980</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1633</name>
          <addressOffset>0x2984</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1634</name>
          <addressOffset>0x2988</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1635</name>
          <addressOffset>0x298c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1636</name>
          <addressOffset>0x2990</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1637</name>
          <addressOffset>0x2994</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1638</name>
          <addressOffset>0x2998</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1639</name>
          <addressOffset>0x299c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1640</name>
          <addressOffset>0x29a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1641</name>
          <addressOffset>0x29a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1642</name>
          <addressOffset>0x29a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1643</name>
          <addressOffset>0x29ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1644</name>
          <addressOffset>0x29b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1645</name>
          <addressOffset>0x29b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1646</name>
          <addressOffset>0x29b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1647</name>
          <addressOffset>0x29bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1648</name>
          <addressOffset>0x29c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1649</name>
          <addressOffset>0x29c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1650</name>
          <addressOffset>0x29c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1651</name>
          <addressOffset>0x29cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1652</name>
          <addressOffset>0x29d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1653</name>
          <addressOffset>0x29d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1654</name>
          <addressOffset>0x29d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1655</name>
          <addressOffset>0x29dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1656</name>
          <addressOffset>0x29e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1657</name>
          <addressOffset>0x29e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1658</name>
          <addressOffset>0x29e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1659</name>
          <addressOffset>0x29ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1660</name>
          <addressOffset>0x29f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1661</name>
          <addressOffset>0x29f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1662</name>
          <addressOffset>0x29f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1663</name>
          <addressOffset>0x29fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1664</name>
          <addressOffset>0x2a00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1665</name>
          <addressOffset>0x2a04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1666</name>
          <addressOffset>0x2a08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1667</name>
          <addressOffset>0x2a0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1668</name>
          <addressOffset>0x2a10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1669</name>
          <addressOffset>0x2a14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1670</name>
          <addressOffset>0x2a18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1671</name>
          <addressOffset>0x2a1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1672</name>
          <addressOffset>0x2a20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1673</name>
          <addressOffset>0x2a24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1674</name>
          <addressOffset>0x2a28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1675</name>
          <addressOffset>0x2a2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1676</name>
          <addressOffset>0x2a30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1677</name>
          <addressOffset>0x2a34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1678</name>
          <addressOffset>0x2a38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1679</name>
          <addressOffset>0x2a3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1680</name>
          <addressOffset>0x2a40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1681</name>
          <addressOffset>0x2a44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1682</name>
          <addressOffset>0x2a48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1683</name>
          <addressOffset>0x2a4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1684</name>
          <addressOffset>0x2a50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1685</name>
          <addressOffset>0x2a54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1686</name>
          <addressOffset>0x2a58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1687</name>
          <addressOffset>0x2a5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1688</name>
          <addressOffset>0x2a60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1689</name>
          <addressOffset>0x2a64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1690</name>
          <addressOffset>0x2a68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1691</name>
          <addressOffset>0x2a6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1692</name>
          <addressOffset>0x2a70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1693</name>
          <addressOffset>0x2a74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1694</name>
          <addressOffset>0x2a78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1695</name>
          <addressOffset>0x2a7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1696</name>
          <addressOffset>0x2a80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1697</name>
          <addressOffset>0x2a84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1698</name>
          <addressOffset>0x2a88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1699</name>
          <addressOffset>0x2a8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1700</name>
          <addressOffset>0x2a90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1701</name>
          <addressOffset>0x2a94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1702</name>
          <addressOffset>0x2a98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1703</name>
          <addressOffset>0x2a9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1704</name>
          <addressOffset>0x2aa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1705</name>
          <addressOffset>0x2aa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1706</name>
          <addressOffset>0x2aa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1707</name>
          <addressOffset>0x2aac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1708</name>
          <addressOffset>0x2ab0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1709</name>
          <addressOffset>0x2ab4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1710</name>
          <addressOffset>0x2ab8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1711</name>
          <addressOffset>0x2abc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1712</name>
          <addressOffset>0x2ac0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1713</name>
          <addressOffset>0x2ac4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1714</name>
          <addressOffset>0x2ac8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1715</name>
          <addressOffset>0x2acc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1716</name>
          <addressOffset>0x2ad0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1717</name>
          <addressOffset>0x2ad4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1718</name>
          <addressOffset>0x2ad8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1719</name>
          <addressOffset>0x2adc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1720</name>
          <addressOffset>0x2ae0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1721</name>
          <addressOffset>0x2ae4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1722</name>
          <addressOffset>0x2ae8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1723</name>
          <addressOffset>0x2aec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1724</name>
          <addressOffset>0x2af0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1725</name>
          <addressOffset>0x2af4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1726</name>
          <addressOffset>0x2af8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1727</name>
          <addressOffset>0x2afc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1728</name>
          <addressOffset>0x2b00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1729</name>
          <addressOffset>0x2b04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1730</name>
          <addressOffset>0x2b08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1731</name>
          <addressOffset>0x2b0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1732</name>
          <addressOffset>0x2b10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1733</name>
          <addressOffset>0x2b14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1734</name>
          <addressOffset>0x2b18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1735</name>
          <addressOffset>0x2b1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1736</name>
          <addressOffset>0x2b20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1737</name>
          <addressOffset>0x2b24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1738</name>
          <addressOffset>0x2b28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1739</name>
          <addressOffset>0x2b2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1740</name>
          <addressOffset>0x2b30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1741</name>
          <addressOffset>0x2b34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1742</name>
          <addressOffset>0x2b38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1743</name>
          <addressOffset>0x2b3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1744</name>
          <addressOffset>0x2b40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1745</name>
          <addressOffset>0x2b44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1746</name>
          <addressOffset>0x2b48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1747</name>
          <addressOffset>0x2b4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1748</name>
          <addressOffset>0x2b50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1749</name>
          <addressOffset>0x2b54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1750</name>
          <addressOffset>0x2b58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1751</name>
          <addressOffset>0x2b5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1752</name>
          <addressOffset>0x2b60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1753</name>
          <addressOffset>0x2b64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1754</name>
          <addressOffset>0x2b68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1755</name>
          <addressOffset>0x2b6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1756</name>
          <addressOffset>0x2b70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1757</name>
          <addressOffset>0x2b74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1758</name>
          <addressOffset>0x2b78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1759</name>
          <addressOffset>0x2b7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1760</name>
          <addressOffset>0x2b80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1761</name>
          <addressOffset>0x2b84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1762</name>
          <addressOffset>0x2b88</addressOffset>
          <size>0x20</size>
        </register>
