modm-ext/archive-stmicro-svd/header_stm32l4r7aii6.svd
        <register>
          <name>LUT.1926</name>
          <addressOffset>0x2e18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1927</name>
          <addressOffset>0x2e1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1928</name>
          <addressOffset>0x2e20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1929</name>
          <addressOffset>0x2e24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1930</name>
          <addressOffset>0x2e28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1931</name>
          <addressOffset>0x2e2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1932</name>
          <addressOffset>0x2e30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1933</name>
          <addressOffset>0x2e34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1934</name>
          <addressOffset>0x2e38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1935</name>
          <addressOffset>0x2e3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1936</name>
          <addressOffset>0x2e40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1937</name>
          <addressOffset>0x2e44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1938</name>
          <addressOffset>0x2e48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1939</name>
          <addressOffset>0x2e4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1940</name>
          <addressOffset>0x2e50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1941</name>
          <addressOffset>0x2e54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1942</name>
          <addressOffset>0x2e58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1943</name>
          <addressOffset>0x2e5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1944</name>
          <addressOffset>0x2e60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1945</name>
          <addressOffset>0x2e64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1946</name>
          <addressOffset>0x2e68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1947</name>
          <addressOffset>0x2e6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1948</name>
          <addressOffset>0x2e70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1949</name>
          <addressOffset>0x2e74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1950</name>
          <addressOffset>0x2e78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1951</name>
          <addressOffset>0x2e7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1952</name>
          <addressOffset>0x2e80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1953</name>
          <addressOffset>0x2e84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1954</name>
          <addressOffset>0x2e88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1955</name>
          <addressOffset>0x2e8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1956</name>
          <addressOffset>0x2e90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1957</name>
          <addressOffset>0x2e94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1958</name>
          <addressOffset>0x2e98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1959</name>
          <addressOffset>0x2e9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1960</name>
          <addressOffset>0x2ea0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1961</name>
          <addressOffset>0x2ea4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1962</name>
          <addressOffset>0x2ea8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1963</name>
          <addressOffset>0x2eac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1964</name>
          <addressOffset>0x2eb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1965</name>
          <addressOffset>0x2eb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1966</name>
          <addressOffset>0x2eb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1967</name>
          <addressOffset>0x2ebc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1968</name>
          <addressOffset>0x2ec0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1969</name>
          <addressOffset>0x2ec4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1970</name>
          <addressOffset>0x2ec8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1971</name>
          <addressOffset>0x2ecc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1972</name>
          <addressOffset>0x2ed0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1973</name>
          <addressOffset>0x2ed4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1974</name>
          <addressOffset>0x2ed8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1975</name>
          <addressOffset>0x2edc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1976</name>
          <addressOffset>0x2ee0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1977</name>
          <addressOffset>0x2ee4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1978</name>
          <addressOffset>0x2ee8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1979</name>
          <addressOffset>0x2eec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1980</name>
          <addressOffset>0x2ef0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1981</name>
          <addressOffset>0x2ef4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1982</name>
          <addressOffset>0x2ef8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1983</name>
          <addressOffset>0x2efc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1984</name>
          <addressOffset>0x2f00</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1985</name>
          <addressOffset>0x2f04</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1986</name>
          <addressOffset>0x2f08</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1987</name>
          <addressOffset>0x2f0c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1988</name>
          <addressOffset>0x2f10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1989</name>
          <addressOffset>0x2f14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1990</name>
          <addressOffset>0x2f18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1991</name>
          <addressOffset>0x2f1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1992</name>
          <addressOffset>0x2f20</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1993</name>
          <addressOffset>0x2f24</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1994</name>
          <addressOffset>0x2f28</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1995</name>
          <addressOffset>0x2f2c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1996</name>
          <addressOffset>0x2f30</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1997</name>
          <addressOffset>0x2f34</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1998</name>
          <addressOffset>0x2f38</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.1999</name>
          <addressOffset>0x2f3c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2000</name>
          <addressOffset>0x2f40</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2001</name>
          <addressOffset>0x2f44</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2002</name>
          <addressOffset>0x2f48</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2003</name>
          <addressOffset>0x2f4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2004</name>
          <addressOffset>0x2f50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2005</name>
          <addressOffset>0x2f54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2006</name>
          <addressOffset>0x2f58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2007</name>
          <addressOffset>0x2f5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2008</name>
          <addressOffset>0x2f60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2009</name>
          <addressOffset>0x2f64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2010</name>
          <addressOffset>0x2f68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2011</name>
          <addressOffset>0x2f6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2012</name>
          <addressOffset>0x2f70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2013</name>
          <addressOffset>0x2f74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2014</name>
          <addressOffset>0x2f78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2015</name>
          <addressOffset>0x2f7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2016</name>
          <addressOffset>0x2f80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2017</name>
          <addressOffset>0x2f84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2018</name>
          <addressOffset>0x2f88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2019</name>
          <addressOffset>0x2f8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2020</name>
          <addressOffset>0x2f90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2021</name>
          <addressOffset>0x2f94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2022</name>
          <addressOffset>0x2f98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2023</name>
          <addressOffset>0x2f9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2024</name>
          <addressOffset>0x2fa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2025</name>
          <addressOffset>0x2fa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2026</name>
          <addressOffset>0x2fa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2027</name>
          <addressOffset>0x2fac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2028</name>
          <addressOffset>0x2fb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2029</name>
          <addressOffset>0x2fb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2030</name>
          <addressOffset>0x2fb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2031</name>
          <addressOffset>0x2fbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2032</name>
          <addressOffset>0x2fc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2033</name>
          <addressOffset>0x2fc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2034</name>
          <addressOffset>0x2fc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2035</name>
          <addressOffset>0x2fcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2036</name>
          <addressOffset>0x2fd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2037</name>
          <addressOffset>0x2fd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2038</name>
          <addressOffset>0x2fd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2039</name>
          <addressOffset>0x2fdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2040</name>
          <addressOffset>0x2fe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2041</name>
          <addressOffset>0x2fe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2042</name>
          <addressOffset>0x2fe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2043</name>
          <addressOffset>0x2fec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2044</name>
          <addressOffset>0x2ff0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2045</name>
          <addressOffset>0x2ff4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2046</name>
          <addressOffset>0x2ff8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>LUT.2047</name>
          <addressOffset>0x2ffc</addressOffset>
          <size>0x20</size>
        </register>
